OpenFOAM_Maincode/tutorials/isothermalFluid/potentialFreeSurfaceOscillatingBox/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    freeSurface
    {
        type            calculated;
        value           uniform 300;
    }
    walls
    {
        type            calculated;
        value           uniform 300;
    }
    floatingObject
    {
        type            calculated;
        value           uniform 300;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
